{
  "main": {
    "name":"Barry Tran",
    "location": "Vancouver, BC",
    "image":"profile_picture.jpg",
    "bio":[
      "I'm a Software Developer based in Vancouver, BC.",
      "My current area of expertise is Site Reliability Engineering for distributed systems, most recently with GCP.",
      "I am experienced in improving the reliability of production services. Some examples of this work includes working with project managers to maintain a production schedule, automating deployment processes, updating infrastructure for multi-zone redundancy, and responding to pages and incidents impacting production services.",
      "In addition to development, I take on leadership roles for my teams such as project planning, mentoring, and running meetings.",
      "Thanks for taking time to view my personal site."
    ],
    "email": "tran.barry.bat060@gmail.com",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/barry-tran-a70b2180",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/tran-barry",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "work":[
      {
        "company":"Kabam Games",
        "title":"Software Engineer - SRE",
        "years":"2018 - Present",
        "description":"Responsible for ensuring uptime of Kabam's games. This involved looking at non-technical problems (un-clear processes, inadequate testing), technical problems (automating deployment processes, adding redundancy to backend services), and responding to live incidents."
      },
      {
        "company":"iQmetrix",
        "title":"Software Developer - API",
        "years":"2017 - 2018",
        "description":"Design and develop solutions to align iQMetrix' APIs. Also facilitated agile practices as Scrum Master and provided mentorship for junior developers."
      },
      {
        "company":"iQmetrix",
        "title":"Software Developer - DevOps",
        "years":"2015 - 2017",
        "description":"Provided scripts and templates to automate all parts of the build and deployment pipeline. Also provided monitoring solutions and production support for multiple services."
      },
      {
        "company":"iQmetrix",
        "title":"Software Developer - SDET",
        "years":"2014 - 2015",
        "description":"Maintained UI tests for a large WPF application. Developed custom UI testing framework for test stability."
      }
    ],
    "skills":[
      {
        "parentSkillName":"Programming Languages",
        "childSkills": "Javascript, Bash, C#, Powershell, Python, Ruby"
      },
      {
        "parentSkillName":"Frameworks",
        "childSkills": "Node, .NET"
      },
      {
        "parentSkillName":"Data",
        "childSkills": "MongoDB, Redis, NoSQL, SQL"
      },
      {
        "parentSkillName":"Development Tools",
        "childSkills": "GitHub Actions, Gitlab CI, Terraform, Ansible, Git, JIRA, Docker, MSBuild, MSDeploy, TeamCity, VSTS/TFS (Now known as Azure Deploy)"
      },
      {
        "parentSkillName":"Service Reliability Tools",
        "childSkills": "HostedGraphite, Grafana, NewRelic, PagerDuty, Site24x7, SCOM"
      },
      {
        "parentSkillName":"GCP",
        "childSkills": "Load Balancer, Compute Engine (VMs), Functions, DNS, Storage"
      },
      {
        "parentSkillName":"AWS",
        "childSkills": "S3, Route53"
      },
      {
        "parentSkillName":"Microsoft Azure Services",
        "childSkills": "APIManagement, Application Insights, ARM Templates, Blob Storage, Cloud Service, CosmosDB, Event Hub, Web App, Functions, Linux Web App, Service Bus, Table Storage, Traffic Manager"
      }
    ],
    "education":[
      {
        "school":"Scrum Alliance",
        "degree":"Certified Scrum Master",
        "graduated":"2017"
      },
      {
        "school":"University of Saskatchewan",
        "degree":"B.E. in Engineering Physics",
        "graduated":"2013"
      },
      {
        "school":"University of Saskatchewan",
        "degree":"B.Sc. in Computer Science",
        "graduated":"2013"
      }
    ]
  },
  "extras":{
    "extras":[
      {
        "header":"Dungeons and Dragons",
        "text":"I'm a relatively new DM that has ran a few modules. Still learning!"
      },
      {
        "header":"Video Games",
        "text":"I'm passionate about video games - both playing and developing them. I've participated in multiple Game Jams, and regularly learn about designing them in my spare time."
      },
      {
        "header":"Figure Skating",
        "text":"In my youth, I competed at the national level for Figure Skating."
      }
    ]
  }
}
